<template>
  <div class="page-wrapper">
    <h1>О нас</h1>
    <div class="info-container fl">
      <div class="info-container-text-wrapper">
        <TextSection>
          <p>Мы - Анна и Катя, друзья с детства, которые всегда любили готовить вместе и мечтали открыть свой бизнес. С 2012 года мы начали выпекать торты и десерты для своих знакомых и коллег, и наши сладости всегда вызывали восторг. Это вдохновило нас бросить свои прежние работы и открыть свою кондитерскую - <span class="highlighted">Candys</span></p>
          <p>Наше производство постепенно росло, и сейчас мы имеем цех с 16 членами команды. Но важнее всего для нас всегда было <span class="highlighted">качество</span> нашей продукции. Мы используем только <span class="highlighted">лучшие</span> ингредиенты, включая <span class="highlighted">натуральные</span> молочные сливки, <span class="highlighted">качественное</span> масло и шоколад <span class="highlighted">высшего</span> качества. Мы убеждены, что наши клиенты заслуживают только самого <span class="highlighted">лучшего качества</span>.</p>
        </TextSection>
      </div>
      <div class="image-wrapper">
        <img src="../assets/images/photos/confectioner.avif">
      </div>
    </div>
    <TextSection>
      <p>Наше меню постоянно <span class="highlighted">расширяется</span>, и мы готовим торты и десерты на любой вкус и для любого мероприятия - свадьбы, дни рождения, корпоративные мероприятия и многое другое. Мы уверены, что наши торты и десерты смогут украсить любое торжество.</p>
      <p>Все наши продукты сертифицированы и мы гордимся тем, что предоставляем только самое <span class="highlighted">лучшее качество</span>. Мы любим свою работу и всегда готовы искать новые способы улучшить нашу продукцию и сервис. Обращайтесь к нам, мы всегда рады новым клиентам и готовы ответить на все ваши вопросы.</p>
    </TextSection>
    <h1>Доставка</h1>
    <TextSection>
      <p>Мы в Candys также уделяем особое внимание <span class="highlighted">качеству нашей доставки</span>, чтобы ваш заказ был получен вовремя и в идеальном состоянии. Мы предлагаем несколько вариантов доставки для вашего удобства, включая <span class="highlighted">самовывоз</span> и <span class="highlighted">доставку курьером</span>.</p>
      <p>Для тех, кто предпочитает забрать свой заказ самостоятельно, мы предоставляем возможность <span class="highlighted">самовывоза</span>. Вы можете приехать к нам в кондитерскую и забрать свой заказ лично в удобное для вас время.</p>
      <p>Мы также предлагаем возможность доставки к определенному времени, чтобы удовлетворить ваши потребности и позволить вам получить свой заказ именно в тот момент, когда вам удобно. Пожалуйста, свяжитесь с нами, чтобы узнать о наших услугах доставки к определенному времени.</p>
      <p>Стоимость доставки в Candys составляет <span class="highlighted">250 рублей</span>, однако мы предоставляем <span class="highlighted">бесплатную доставку</span> для заказов на сумму свыше <span class="highlighted">2000 рублей</span>. Мы стремимся предоставлять высококачественный сервис и максимально удобные условия для наших клиентов, и надеемся, что вы останетесь довольны нашими услугами доставки.</p>
    </TextSection>
    <h1>Оплата</h1>
    <TextSection>
      <p>Мы всегда стремимся сделать процесс оплаты максимально удобным для наших клиентов, поэтому предлагаем несколько вариантов оплаты. Вы можете произвести оплату наличными при получении заказа или воспользоваться банковской картой. Также у нас есть возможность оплаты через <span class="highlighted">онлайн-сервисы</span>.</p>
      <p>Мы работаем с несколькими <span class="highlighted">платежными системами</span>, чтобы вы могли выбрать наиболее удобный и безопасный способ для себя. Среди наиболее популярных <span class="highlighted">платежных систем</span>, с которыми мы работаем, можно назвать <span class="highlighted">Яндекс.Кассу</span>, <span class="highlighted">PayPal</span> и <span class="highlighted">WebMoney</span>.</p>
      <p><span class="highlighted">Онлайн-оплата</span> на нашем сайте абсолютно безопасна. Мы используем передовые технологии шифрования, чтобы защитить ваши личные данные и данные вашей банковской карты от несанкционированного доступа. Поэтому вы можете быть уверены, что ваша оплата проходит в безопасной среде, а ваши данные не будут переданы третьим лицам.</p>
      <p>Мы всегда готовы ответить на ваши вопросы по поводу оплаты и помочь вам выбрать наиболее удобный способ оплаты для вашего заказа. Мы ценим наших клиентов и делаем все возможное, чтобы сделать процесс оплаты максимально простым и <span class="highlighted">безопасным</span>.</p>
    </TextSection>
    <div>
      <img src="../assets/images/paymentsvariants.png">
    </div>
    <h1>Контакты</h1>
    <ContactsSection/>

  </div>
</template>

<script>
import TextSection from "@/components/UI/TextSection";
import ContactsSection from "@/components/ContactsSection";
export default {
  name: "AboutUsPage",
  components: {ContactsSection, TextSection}

}
</script>

<style scoped>
  .image-wrapper {
    width: 640px;
    overflow: hidden;
    padding: 15px;
    box-sizing: border-box;
  }
  .info-container {
    width: 100%;
  }

  .info-container-text-wrapper {
    width: 50%
  }

  .image-wrapper img {
    width: 100%;
  }

  .page-wrapper {
    gap: 40px;
  }


</style>